{
  "plugins": {
    "fastspell.nvim": {
      "src": "https://github.com/lucaSartore/fastspell.nvim"
    },
    "fleur.nvim": {
      "src": "https://github.com/aikhe/fleur.nvim"
    },
    "mini.completion": {
      "src": "https://github.com/nvim-mini/mini.completion"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim-dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "nvim-java": {
      "src": "https://github.com/nvim-java/nvim-java"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "oxocarbon.nvim": {
      "src": "https://github.com/nyoom-engineering/oxocarbon.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "spring-boot.nvim": {
      "src": "https://github.com/JavaHello/spring-boot.nvim",
      "version": "'218c0c26c14d99feca778e4d13f5ec3e8b1b60f0'"
    },
    "telescope-fzf-native.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-fzf-native.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "tinymist": {
      "src": "https://github.com/Myriad-Dreamin/tinymist"
    },
    "typst-preview.nvim": {
      "src": "https://github.com/chomosuke/typst-preview.nvim"
    }
  }
}